rule aws_iam_access_denied_discovery_events {

  meta:
    author = "Chronicle Security"
    description = "Detects excessive AccessDenied events within an hour timefram from an IAM User"
    mitre_attack_tactic = "Discovery"
    mitre_attack_technique = "Cloud Infrastructure Discovery"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1580/"
    mitre_attack_version = "v1.3"
    severity = "Low"
    priority = "Low"

  events:
    $cloudtrail.metadata.vendor_name = "AMAZON" 
    $cloudtrail.metadata.product_name = "AWS CloudTrail"
    $cloudtrail.security_result.rule_id = "AccessDenied"
    $cloudtrail.security_result.action = "BLOCK"
    $cloudtrail.principal.user.userid = $user_id
    $cloudtrail.target.application = $target_application
    $cloudtrail.metadata.product_event_type = $product_event_type

  match:
    $user_id over 1h

  outcome:
    $risk_score = max(
        // Unauthorized geographies
        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region = "Cuba", 40) +
        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region = "Iran", 40) +
        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region = "North Korea" , 40) +
        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region = "Russia", 40) +
        if($cloudtrail.principal.ip_geo_artifact.location.country_or_region = "Syria", 40)
    )
    $networkHttpUserAgent = array_distinct($cloudtrail.network.http.user_agent)
    $principalIp = array_distinct($cloudtrail.principal.ip)
    $principalIpCountry = array_distinct($cloudtrail.principal.ip_geo_artifact.location.country_or_region)
    $principalIpState = array_distinct($cloudtrail.principal.ip_geo_artifact.location.state)
    $principalUserDisplayName = array_distinct($cloudtrail.principal.user.user_display_name)
    $awsAccount = array_distinct($cloudtrail.target.resource.attribute.labels["Recipient Account Id"])
    $awsRegion = array_distinct($cloudtrail.principal.location.name)

  condition:
    #cloudtrail > 5 and #target_application > 1 and #product_event_type > 1
}
