rule vt_relationships_file_contacts_ip {
  meta:
    author = "Chronicle Security"
    description = "Alert on known Hash contacting known IP with VT Relationships."
    severity = "High"
    priority = "High"

  events:
    // event
    $e.metadata.event_type = "NETWORK_CONNECTION"
    $e.principal.process.file.sha256 = $file_hash
    $e.target.ip = $ip
    $e.principal.hostname = $hostname

    // principal
    $vt.graph.metadata.entity_type = "FILE"
    $vt.graph.metadata.source_type = "GLOBAL_CONTEXT"
    $vt.graph.metadata.vendor_name = "VirusTotal"
    $vt.graph.metadata.product_name = "VirusTotal Relationships"
    $vt.graph.entity.file.sha256 = $file_hash

    // target
    $vt.graph.relations.entity_type = "IP_ADDRESS"
    $vt.graph.relations.relationship = "CONTACTS"
    $vt.graph.relations.entity.ip = $ip

  match:
    $hostname over 5m

  condition:
    $e and $vt
}
